conf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ГенерацияЗаписейВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/CommonModules/ЭП_ПочтовыеФункции/Module.bsl
#Область ПрограмныйИнтерфейс

Функция СоздатьТекстПисьма(Ответственный, Департамент, ТабЧастьСотрудники, ПроектДокумента, Ссылка) Экспорт

	HTMLТекст = 
	"<html>
	|<head>
	|<meta http-equiv=Content-Type content=""text/html; charset=windows-1251"">
	|<meta name=Generator content=""Microsoft Word 14 (filtered)"">
	|<style type=""text/css"">
	|
	|    body {
	|         margin-top: 2px;
	|         margin-left: 2px;
	|         margin-right: 2px;
	|         font-family: Arial; 
	|         font-size: 12pt;}
	|    table {
	|          border: 1px solid #000;
	|          border-collapse: collapse;
	|        	text-align: center;}
	|    td {
	|       border: 1px solid;
	|		text-align: center;}
	|    th {
	|       border: 1px solid;
	|		text-align: center;}
	|    a:link {
	|           color: #006699;} 
	|    a:hover {
	|            color: #006699; 
	|            text-decoration: underline;}
	|    p {
	|      margin-top: 10px;}
	|    img {
	|        width: 150;
	|        height: 150}
	|
	|</style>
	|</head>";
		
	HTMLТекст = HTMLТекст + "<body>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Здравствуйте, ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + Ответственный;
	HTMLТекст = HTMLТекст + "<br>"; 
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Создано утверждение переработок по проекту: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + ПроектДокумента;
	HTMLТекст = HTMLТекст + "<br>";  
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Ссылка на документ в тонком клиенте: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + ПолучитьНавигационнуюСсылку(Ссылка);
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Ссылка на документ в веб-клиенте: ";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + "<a href=";
	HTMLТекст = HTMLТекст + "http://prod-1c.edit-pro.ru/prod_ep_sppr/#e1cib/data/";
	HTMLТекст = HTMLТекст + СтрЗаменить(ПолучитьНавигационнуюСсылку(Ссылка),"e1cib/data/","");
	HTMLТекст = HTMLТекст + ">";
	HTMLТекст = HTMLТекст + "Ссылка";
	HTMLТекст = HTMLТекст + "</a>";
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<font color=#413003>";
	HTMLТекст = HTMLТекст + "Следующие сотрудники имеют переработки:";
	HTMLТекст = HTMLТекст + "</font>";
	HTMLТекст = HTMLТекст + "<br>";
	
	HTMLТекст = HTMLТекст + "<table>";
	HTMLТекст = HTMLТекст + "<tr>";   
	HTMLТекст = HTMLТекст + "<th>Департамент</th>";
	HTMLТекст = HTMLТекст + "<th>Сотрудник</th>";
	HTMLТекст = HTMLТекст + "<th>Этап</th>";
	HTMLТекст = HTMLТекст + "<th>Технический проект</th>";
	HTMLТекст = HTMLТекст + "<th>Задача</th>";
	HTMLТекст = HTMLТекст + "<th>Дата</th>";
	HTMLТекст = HTMLТекст + "<th>Часы по табелю</th>";
	HTMLТекст = HTMLТекст + "<th>Часы переработок</th>";
	HTMLТекст = HTMLТекст + "<th>Часы фактические</th>";
	HTMLТекст = HTMLТекст + "<th>Отгул</th>";
	HTMLТекст = HTMLТекст + "</tr>";
	
	Для Каждого Элемент Из ТабЧастьСотрудники Цикл
		
		Если Департамент = 0 ИЛИ Элемент.Департамент = Департамент Тогда
			
			HTMLТекст = HTMLТекст + "<tr>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Департамент + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Сотрудник + "</td>"; 
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Этап + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ТехническийПроект + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Задача + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Дата + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыПоТабелю + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыПереработок + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.ЧасыФакт + "</td>";
			HTMLТекст = HTMLТекст + "<td>" + Элемент.Отгул + "</td>";
			HTMLТекст = HTMLТекст + "</tr>";
			
		КонецЕсли;
		
	КонецЦикла;
	
	HTMLТекст = HTMLТекст + "</table>";
	
	Возврат HTMLТекст;
	
КонецФункции

Функция ПолучитьМассивОтветственных(Проект) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);

	МассивДанныхПользователей = Новый Массив; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
	|	ГруппыДоступа.Профиль КАК Профиль
	|ПОМЕСТИТЬ ВТ_Профили
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Профили.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_Роли
	|ИЗ
	|	ВТ_Профили КАК ВТ_Профили
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|		ПО ВТ_Профили.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль = &Роль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Профили.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.ЭП_Сотрудник КАК ЭП_Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	ВТ_Роли КАК ВТ_Роли
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ВТ_Роли.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.ЭП_Сотрудник <> ЗНАЧЕНИЕ(Справочник.ЭП_Сотрудники.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудники.ЭП_Сотрудник КАК Сотрудник,
	|	ЭП_СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	0 КАК Департамент
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.КонтактнаяИнформация КАК ЭП_СотрудникиКонтактнаяИнформация
	|		ПО ВТ_Сотрудники.ЭП_Сотрудник = ЭП_СотрудникиКонтактнаяИнформация.Ссылка"; 
	
	Индентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Роли["ЭП_ОтправкаПисем"]);
	Запрос.УстановитьПараметр("Роль", Индентификатор);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		Выборка = РезультатЗапроса.Выбрать();			
		Пока Выборка.Следующий() Цикл			
			СтруктураОтветственных = Новый Структура;
			СтруктураОтветственных.Вставить("АдресЭП", Выборка.АдресЭП);
			СтруктураОтветственных.Вставить("Ответственный", Выборка.Сотрудник); 
			СтруктураОтветственных.Вставить("Департамент", 0);
            МассивДанныхПользователей.Добавить(СтруктураОтветственных);					
		КонецЦикла;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ЭП_Сотрудник КАК ЭП_Сотрудник,
		|	ПроектыУведомлениеРуководителей.Почта КАК Почта,
		|	ЕСТЬNULL(ПроектыУведомлениеРуководителей.Департамент, 0) КАК Департамент
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.УведомлениеРуководителей КАК ПроектыУведомлениеРуководителей
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО (Пользователи.ЭП_Сотрудник = ПроектыУведомлениеРуководителей.Сотрудник)
		|		ПО (ПроектыУведомлениеРуководителей.Ссылка = Проекты.Ссылка)
		|ГДЕ
		|	Проекты.Ссылка = &Проект
		|	И ПроектыУведомлениеРуководителей.Почта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.ЭП_Сотрудник КАК Сотрудник,
		|	ЭП_СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	ВЫБОР
		|		КОГДА ВТ.Департамент ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВТ.ЭП_Сотрудник.Департамент
		|	КОНЕЦ КАК Департамент
		|ПОМЕСТИТЬ ВТ_СотрудникиПоПроектам
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники.КонтактнаяИнформация КАК ЭП_СотрудникиКонтактнаяИнформация
		|		ПО ВТ.ЭП_Сотрудник = ЭП_СотрудникиКонтактнаяИнформация.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СотрудникиПоПроектам.Сотрудник КАК Сотрудник,
		|	ВТ_СотрудникиПоПроектам.АдресЭП КАК АдресЭП,
		|	ВТ_СотрудникиПоПроектам.Департамент КАК Департамент
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	ВТ_СотрудникиПоПроектам КАК ВТ_СотрудникиПоПроектам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итоги.Сотрудник КАК Сотрудник,
		|	ВТ_Итоги.АдресЭП КАК АдресЭП,
		|	ВТ_Итоги.Департамент КАК Департамент
		|ИЗ
		|	ВТ_Итоги КАК ВТ_Итоги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итоги.Сотрудник,
		|	ВТ_Итоги.АдресЭП,
		|	ВТ_Итоги.Департамент";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивДанныхПользователейИзСправочникаПроекты = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаПроекты = РезультатЗапроса.Выбрать();
		Пока ВыборкаПроекты.Следующий() Цикл
			Для Каждого ЭлементМассива Из МассивДанныхПользователей Цикл
				Если ЭлементМассива.АдресЭП <> ВыборкаПроекты.АдресЭП Тогда 
					СтруктураОтветственных = Новый Структура;
					СтруктураОтветственных.Вставить("АдресЭП", ВыборкаПроекты.АдресЭП);
					СтруктураОтветственных.Вставить("Ответственный", ВыборкаПроекты.Сотрудник); 
					СтруктураОтветственных.Вставить("Департамент", ВыборкаПроекты.Департамент);
					МассивДанныхПользователейИзСправочникаПроекты.Добавить(СтруктураОтветственных);					
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла; 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДанныхПользователей, МассивДанныхПользователейИзСправочникаПроекты);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат МассивДанныхПользователей;
	
КонецФункции 

#КонецОбласти
